Document doesn't contain any warnings related to these elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoRelatedWarnings { get; }
  Visual Basic
Public Shared ReadOnly Property NoRelatedWarnings As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoRelatedWarnings {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace